#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mconfluent_environment.PROD-Kafka: Refreshing state... [id=env-kgqz5p][0m
[0m[1mconfluent_service_account.app-manager-PROD-Kafka: Refreshing state... [id=sa-nrzjg3][0m
[0m[1mconfluent_service_account.Fraud-Service_PROD-Kafka: Refreshing state... [id=sa-pw82v2][0m
[0m[1mconfluent_service_account.Catalogue-Services_PROD-Kafka: Refreshing state... [id=sa-qzm0xd][0m
[0m[1mconfluent_service_account.Inventory-Service_PROD-Kafka: Refreshing state... [id=sa-7k328j][0m
[0m[1mconfluent_service_account.Basket-Service---Basket-Writer-REST-proxy_PROD-Kafka: Refreshing state... [id=sa-25mzo2][0m
[0m[1mconfluent_service_account.Basket-Service---Basket-View-kSQL_PROD-Kafka: Refreshing state... [id=sa-jzxp1q][0m
[0m[1mconfluent_service_account.Orders-Service----Order-Writer_PROD-Kafka: Refreshing state... [id=sa-x61d31][0m
[0m[1mconfluent_service_account.Order-Details-Service_PROD-Kafka: Refreshing state... [id=sa-oz0rpp][0m
[0m[1mdata.confluent_schema_registry_region.essentials: Reading...[0m[0m
[0m[1mconfluent_service_account.Orders-Service---Orders-View_PROD-Kafka: Refreshing state... [id=sa-158px3][0m
[0m[1mconfluent_service_account.Email-Service_PROD-Kafka: Refreshing state... [id=sa-rvy837][0m
[0m[1mconfluent_service_account.Catalogue-Search-Kafka-Connect---Elasticsearch_PROD-Kafka: Refreshing state... [id=sa-v83d0j][0m
[0m[1mconfluent_service_account.Orders-Service---Validations-Aggregator_PROD-Kafka: Refreshing state... [id=sa-g1go8v][0m
[0m[1mdata.confluent_schema_registry_region.essentials: Read complete after 1s [id=sgreg-1][0m
[0m[1mconfluent_service_account.Catalogue-Filter-View-kSQL_PROD-Kafka: Refreshing state... [id=sa-9518n0][0m
[0m[1mconfluent_kafka_cluster.cluster-PROD-Kafka: Refreshing state... [id=lkc-gkodx3][0m
[0m[1mconfluent_schema_registry_cluster.essentials-PROD-Kafka: Refreshing state... [id=lsrc-pk2d5o][0m
[0m[1mconfluent_api_key.Orders-Service---Validations-Aggregator_PROD-Kafka: Refreshing state... [id=D77KZTKT4EQCMZAL][0m
[0m[1mconfluent_api_key.Catalogue-Services_PROD-Kafka: Refreshing state... [id=WE6TILEGAUGQNAJS][0m
[0m[1mconfluent_api_key.Basket-Service---Basket-Writer-REST-proxy_PROD-Kafka: Refreshing state... [id=BLXGBI7T4VFFOVMN][0m
[0m[1mconfluent_api_key.Order-Details-Service_PROD-Kafka: Refreshing state... [id=L75N4SWPZ74MSY3L][0m
[0m[1mconfluent_api_key.Fraud-Service_PROD-Kafka: Refreshing state... [id=C3YVKCQAMSS7OOIJ][0m
[0m[1mconfluent_api_key.Inventory-Service_PROD-Kafka: Refreshing state... [id=DOOOPI557EP3Q75V][0m
[0m[1mconfluent_api_key.Catalogue-Filter-View-kSQL_PROD-Kafka: Refreshing state... [id=YZKTCP7FMWYSAWHY][0m
[0m[1mconfluent_api_key.Catalogue-Search-Kafka-Connect---Elasticsearch_PROD-Kafka: Refreshing state... [id=FBGFWZHCQJ5BBMGV][0m
[0m[1mconfluent_role_binding.app-manager-kafka-cluster-admin-PROD-Kafka: Refreshing state... [id=rb-jojdY][0m
[0m[1mconfluent_api_key.Basket-Service---Basket-View-kSQL_PROD-Kafka: Refreshing state... [id=74YFSOL3QMCARLJY][0m
[0m[1mconfluent_api_key.Orders-Service---Orders-View_PROD-Kafka: Refreshing state... [id=IUMNL7XLYZHN2XCG][0m
[0m[1mconfluent_api_key.Orders-Service----Order-Writer_PROD-Kafka: Refreshing state... [id=36EM4CEDF36KR5LD][0m
[0m[1mconfluent_api_key.Email-Service_PROD-Kafka: Refreshing state... [id=VQ7LWG4K2CVIKWKK][0m
[0m[1mconfluent_api_key.app-manager-PROD-Kafka-kafka-api-key: Refreshing state... [id=WPFCDDN4FQWFTW5K][0m
[0m[1mconfluent_kafka_acl.Basket-Service---Basket-View-kSQL_PROD-Kafka_Read_basket_group: Refreshing state... [id=lkc-gkodx3/GROUP#basket#LITERAL#User:sa-jzxp1q#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Email-Service_PROD-Kafka_Read_orders_group: Refreshing state... [id=lkc-gkodx3/GROUP#orders#LITERAL#User:sa-rvy837#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Inventory-Service_PROD-Kafka_Read_orders_group: Refreshing state... [id=lkc-gkodx3/GROUP#orders#LITERAL#User:sa-7k328j#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Inventory-Service_PROD-Kafka_Read_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-7k328j#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Orders-Service---Validations-Aggregator_PROD-Kafka_Read_order-validations: Refreshing state... [id=lkc-gkodx3/TOPIC#order-validations#LITERAL#User:sa-g1go8v#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Orders-Service----Order-Writer_PROD-Kafka_Write_customers: Refreshing state... [id=lkc-gkodx3/TOPIC#customers#LITERAL#User:sa-x61d31#*#WRITE#ALLOW][0m
[0m[1mconfluent_kafka_acl.Orders-Service---Validations-Aggregator_PROD-Kafka_Write_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-g1go8v#*#WRITE#ALLOW][0m
[0m[1mconfluent_kafka_acl.Catalogue-Services_PROD-Kafka_Write_catalogue: Refreshing state... [id=lkc-gkodx3/TOPIC#catalogue#LITERAL#User:sa-qzm0xd#*#WRITE#ALLOW][0m
[0m[1mconfluent_kafka_acl.Order-Details-Service_PROD-Kafka_Write_order-validations: Refreshing state... [id=lkc-gkodx3/TOPIC#order-validations#LITERAL#User:sa-oz0rpp#*#WRITE#ALLOW][0m
[0m[1mconfluent_kafka_acl.Basket-Service---Basket-Writer-REST-proxy_PROD-Kafka_Write_basket: Refreshing state... [id=lkc-gkodx3/TOPIC#basket#LITERAL#User:sa-25mzo2#*#WRITE#ALLOW][0m
[0m[1mconfluent_kafka_acl.Catalogue-Filter-View-kSQL_PROD-Kafka_Read_catalogue_group: Refreshing state... [id=lkc-gkodx3/GROUP#catalogue#LITERAL#User:sa-9518n0#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Order-Details-Service_PROD-Kafka_Read_orders_group: Refreshing state... [id=lkc-gkodx3/GROUP#orders#LITERAL#User:sa-oz0rpp#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Catalogue-Filter-View-kSQL_PROD-Kafka_Read_warehouse-inventory: Refreshing state... [id=lkc-gkodx3/TOPIC#warehouse-inventory#LITERAL#User:sa-9518n0#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Catalogue-Filter-View-kSQL_PROD-Kafka_Read_warehouse-inventory_group: Refreshing state... [id=lkc-gkodx3/GROUP#warehouse-inventory#LITERAL#User:sa-9518n0#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Catalogue-Filter-View-kSQL_PROD-Kafka_Read_catalogue: Refreshing state... [id=lkc-gkodx3/TOPIC#catalogue#LITERAL#User:sa-9518n0#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Email-Service_PROD-Kafka_Read_payments: Refreshing state... [id=lkc-gkodx3/TOPIC#payments#LITERAL#User:sa-rvy837#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Email-Service_PROD-Kafka_Read_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-rvy837#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Orders-Service---Orders-View_PROD-Kafka_Read_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-158px3#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Email-Service_PROD-Kafka_Read_payments_group: Refreshing state... [id=lkc-gkodx3/GROUP#payments#LITERAL#User:sa-rvy837#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Email-Service_PROD-Kafka_Read_customers: Refreshing state... [id=lkc-gkodx3/TOPIC#customers#LITERAL#User:sa-rvy837#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Email-Service_PROD-Kafka_Read_customers_group: Refreshing state... [id=lkc-gkodx3/GROUP#customers#LITERAL#User:sa-rvy837#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Fraud-Service_PROD-Kafka_Write_order-validations: Refreshing state... [id=lkc-gkodx3/TOPIC#order-validations#LITERAL#User:sa-pw82v2#*#WRITE#ALLOW][0m
[0m[1mconfluent_kafka_acl.Orders-Service----Order-Writer_PROD-Kafka_Write_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-x61d31#*#WRITE#ALLOW][0m
[0m[1mconfluent_kafka_acl.Orders-Service----Order-Writer_PROD-Kafka_Write_payments: Refreshing state... [id=lkc-gkodx3/TOPIC#payments#LITERAL#User:sa-x61d31#*#WRITE#ALLOW][0m
[0m[1mconfluent_kafka_acl.Basket-Service---Basket-View-kSQL_PROD-Kafka_Read_customers: Refreshing state... [id=lkc-gkodx3/TOPIC#customers#LITERAL#User:sa-jzxp1q#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_topic.order-validations: Refreshing state... [id=lkc-gkodx3/order-validations][0m
[0m[1mconfluent_kafka_acl.Inventory-Service_PROD-Kafka_Read_warehouse-inventory_group: Refreshing state... [id=lkc-gkodx3/GROUP#warehouse-inventory#LITERAL#User:sa-7k328j#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Fraud-Service_PROD-Kafka_Read_orders_group: Refreshing state... [id=lkc-gkodx3/GROUP#orders#LITERAL#User:sa-pw82v2#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_topic.payments: Refreshing state... [id=lkc-gkodx3/payments][0m
[0m[1mconfluent_kafka_topic.orders: Refreshing state... [id=lkc-gkodx3/orders][0m
[0m[1mconfluent_kafka_acl.Catalogue-Search-Kafka-Connect---Elasticsearch_PROD-Kafka_Read_catalogue: Refreshing state... [id=lkc-gkodx3/TOPIC#catalogue#LITERAL#User:sa-v83d0j#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Orders-Service---Validations-Aggregator_PROD-Kafka_Read_order-validations_group: Refreshing state... [id=lkc-gkodx3/GROUP#order-validations#LITERAL#User:sa-g1go8v#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Basket-Service---Basket-View-kSQL_PROD-Kafka_Read_basket: Refreshing state... [id=lkc-gkodx3/TOPIC#basket#LITERAL#User:sa-jzxp1q#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Inventory-Service_PROD-Kafka_Write_order-validations: Refreshing state... [id=lkc-gkodx3/TOPIC#order-validations#LITERAL#User:sa-7k328j#*#WRITE#ALLOW][0m
[0m[1mconfluent_kafka_acl.Inventory-Service_PROD-Kafka_Read_warehouse-inventory: Refreshing state... [id=lkc-gkodx3/TOPIC#warehouse-inventory#LITERAL#User:sa-7k328j#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_topic.warehouse-inventory: Refreshing state... [id=lkc-gkodx3/warehouse-inventory][0m
[0m[1mconfluent_kafka_acl.Catalogue-Search-Kafka-Connect---Elasticsearch_PROD-Kafka_Read_catalogue_group: Refreshing state... [id=lkc-gkodx3/GROUP#catalogue#LITERAL#User:sa-v83d0j#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Orders-Service---Orders-View_PROD-Kafka_Read_orders_group: Refreshing state... [id=lkc-gkodx3/GROUP#orders#LITERAL#User:sa-158px3#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Inventory-Service_PROD-Kafka_Write_warehouse-inventory: Refreshing state... [id=lkc-gkodx3/TOPIC#warehouse-inventory#LITERAL#User:sa-7k328j#*#WRITE#ALLOW][0m
[0m[1mconfluent_kafka_topic.catalogue: Refreshing state... [id=lkc-gkodx3/catalogue][0m
[0m[1mconfluent_kafka_acl.Basket-Service---Basket-View-kSQL_PROD-Kafka_Read_customers_group: Refreshing state... [id=lkc-gkodx3/GROUP#customers#LITERAL#User:sa-jzxp1q#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_acl.Order-Details-Service_PROD-Kafka_Read_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-oz0rpp#*#READ#ALLOW][0m
[0m[1mconfluent_kafka_topic.basket: Refreshing state... [id=lkc-gkodx3/basket][0m
[0m[1mconfluent_kafka_topic.customers: Refreshing state... [id=lkc-gkodx3/customers][0m
[0m[1mconfluent_kafka_acl.Fraud-Service_PROD-Kafka_Read_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-pw82v2#*#READ#ALLOW][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # confluent_api_key.Shipping-Service_PROD-Kafka[0m will be created
[0m  [32m+[0m[0m resource "confluent_api_key" "Shipping-Service_PROD-Kafka" {
      [32m+[0m[0m description            = "Kafka API Key that is owned by Shipping-Service service account"
      [32m+[0m[0m disable_wait_for_ready = false
      [32m+[0m[0m display_name           = "Shipping-Service_PROD-Kafka"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m secret                 = (sensitive value)

      [32m+[0m[0m managed_resource {
          [32m+[0m[0m api_version = "cmk/v2"
          [32m+[0m[0m id          = "lkc-gkodx3"
          [32m+[0m[0m kind        = "Cluster"

          [32m+[0m[0m environment {
              [32m+[0m[0m id = "env-kgqz5p"
            }
        }

      [32m+[0m[0m owner {
          [32m+[0m[0m api_version = (known after apply)
          [32m+[0m[0m id          = (known after apply)
          [32m+[0m[0m kind        = (known after apply)
        }
    }

[1m  # confluent_kafka_acl.Shipping-Service_PROD-Kafka_Read_catalogue[0m will be created
[0m  [32m+[0m[0m resource "confluent_kafka_acl" "Shipping-Service_PROD-Kafka_Read_catalogue" {
      [32m+[0m[0m host          = "*"
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m operation     = "READ"
      [32m+[0m[0m pattern_type  = "LITERAL"
      [32m+[0m[0m permission    = "ALLOW"
      [32m+[0m[0m principal     = (known after apply)
      [32m+[0m[0m resource_name = "catalogue"
      [32m+[0m[0m resource_type = "TOPIC"
    }

[1m  # confluent_kafka_acl.Shipping-Service_PROD-Kafka_Read_catalogue_group[0m will be created
[0m  [32m+[0m[0m resource "confluent_kafka_acl" "Shipping-Service_PROD-Kafka_Read_catalogue_group" {
      [32m+[0m[0m host          = "*"
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m operation     = "READ"
      [32m+[0m[0m pattern_type  = "LITERAL"
      [32m+[0m[0m permission    = "ALLOW"
      [32m+[0m[0m principal     = (known after apply)
      [32m+[0m[0m resource_name = "catalogue"
      [32m+[0m[0m resource_type = "GROUP"
    }

[1m  # confluent_kafka_acl.Shipping-Service_PROD-Kafka_Read_customers[0m will be created
[0m  [32m+[0m[0m resource "confluent_kafka_acl" "Shipping-Service_PROD-Kafka_Read_customers" {
      [32m+[0m[0m host          = "*"
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m operation     = "READ"
      [32m+[0m[0m pattern_type  = "LITERAL"
      [32m+[0m[0m permission    = "ALLOW"
      [32m+[0m[0m principal     = (known after apply)
      [32m+[0m[0m resource_name = "customers"
      [32m+[0m[0m resource_type = "TOPIC"
    }

[1m  # confluent_kafka_acl.Shipping-Service_PROD-Kafka_Read_customers_group[0m will be created
[0m  [32m+[0m[0m resource "confluent_kafka_acl" "Shipping-Service_PROD-Kafka_Read_customers_group" {
      [32m+[0m[0m host          = "*"
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m operation     = "READ"
      [32m+[0m[0m pattern_type  = "LITERAL"
      [32m+[0m[0m permission    = "ALLOW"
      [32m+[0m[0m principal     = (known after apply)
      [32m+[0m[0m resource_name = "customers"
      [32m+[0m[0m resource_type = "GROUP"
    }

[1m  # confluent_kafka_acl.Shipping-Service_PROD-Kafka_Write_shipping[0m will be created
[0m  [32m+[0m[0m resource "confluent_kafka_acl" "Shipping-Service_PROD-Kafka_Write_shipping" {
      [32m+[0m[0m host          = "*"
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m operation     = "WRITE"
      [32m+[0m[0m pattern_type  = "LITERAL"
      [32m+[0m[0m permission    = "ALLOW"
      [32m+[0m[0m principal     = (known after apply)
      [32m+[0m[0m resource_name = "shipping"
      [32m+[0m[0m resource_type = "TOPIC"
    }

[1m  # confluent_kafka_topic.shipping[0m will be created
[0m  [32m+[0m[0m resource "confluent_kafka_topic" "shipping" {
      [32m+[0m[0m config           = {
          [32m+[0m[0m "cleanup.policy"                      = "delete"
          [32m+[0m[0m "compression.type"                    = "producer"
          [32m+[0m[0m "delete.retention.ms"                 = "86400000"
          [32m+[0m[0m "file.delete.delay.ms"                = "60000"
          [32m+[0m[0m "flush.messages"                      = "9223372036854775807"
          [32m+[0m[0m "flush.ms"                            = "9223372036854775807"
          [32m+[0m[0m "index.interval.bytes"                = "4096"
          [32m+[0m[0m "max.compaction.lag.ms"               = "9223372036854775807"
          [32m+[0m[0m "max.message.bytes"                   = "2097164"
          [32m+[0m[0m "message.downconversion.enable"       = "true"
          [32m+[0m[0m "message.format.version"              = "3.0-IV1"
          [32m+[0m[0m "message.timestamp.difference.max.ms" = "9223372036854775807"
          [32m+[0m[0m "message.timestamp.type"              = "CreateTime"
          [32m+[0m[0m "min.cleanable.dirty.ratio"           = "0.5"
          [32m+[0m[0m "min.insync.replicas"                 = "2"
          [32m+[0m[0m "retention.bytes"                     = "-1"
          [32m+[0m[0m "retention.ms"                        = "604800000"
          [32m+[0m[0m "segment.bytes"                       = "104857600"
          [32m+[0m[0m "segment.index.bytes"                 = "10485760"
          [32m+[0m[0m "segment.ms"                          = "604800000"
        }
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m partitions_count = 6
      [32m+[0m[0m topic_name       = "shipping"
    }

[1m  # confluent_service_account.Shipping-Service_PROD-Kafka[0m will be created
[0m  [32m+[0m[0m resource "confluent_service_account" "Shipping-Service_PROD-Kafka" {
      [32m+[0m[0m api_version  = (known after apply)
      [32m+[0m[0m description  = "Service account to manage 'PROD-Kafka' Kafka cluster"
      [32m+[0m[0m display_name = "Shipping-Service-PROD-Kafka"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m kind         = (known after apply)
    }

[1mPlan:[0m 8 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @TamimiGitHub, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*